import Header from './components/Header'
import Navigation from './components/Navigation.jsx'
import CentrallContainer from './components/CentrallContainer'


function App() {
const header=[
    {name:"Блог", id:1},
    {name:"Інструменти", id:2},
    {name:"Події", id:3},
    {name:"Корисне", id:4},
    {name:"Канали", id:5},
];

const sideBarContent=[
    {name:"Технології", id:1},
    {name:"Бізнес", id:2},
    {name:"Туризм", id:3},
    {name:"Освіта", id:4},
    {name:"Хоббі", id:5}
]
    const text="Марракеш — це одне з найвідоміших міст Марокко, яке приваблює мандрівників своєю " +
        "яскравою культурою, багатовіковою історією та неповторною атмосферою. Його ще називають «червоним містом» " +
        "завдяки особливому відтінку стін, збудованих із глини, що на заході сонця набуває насиченого золотисто-червоного " +
        "кольору.Місто було засноване ще у XI столітті і довгий час залишалося столицею країни. Тут тісно переплелися арабські," +
        " берберські та андалузькі традиції, що створює унікальний культурний коктейль.Серце Марракеша — це медіна, старе місто, яке " +
        "входить до списку Світової спадщини ЮНЕСКО. З вузьких вуличок доноситься аромат спецій, звуки вуличних музикантів та шум тисяч людей. " +
        "Тут можна легко загубитися, але саме це і є справжня пригода: за кожним поворотом відкриваються нові крамниці, майстерні чи невеликі дворики" +
        " з фонтанами.Особливе місце займає площа Джемаа-ель-Фна — головний майдан Марракеша. Вдень тут можна придбати сувеніри, килими, спеції та ювелірні" +
        " вироби, а ввечері площа перетворюється на великий театр під відкритим небом: акробати, змії-символісти, ворожки, барабанщики та десятки кухарів, " +
        "які готують страви просто на очах у туристів."
  return (
    <>
        <Header data={header}/>
        <div className="content d-flex justify-content-center">
        <Navigation data={sideBarContent}/>
        <CentrallContainer img="https://upload.wikimedia.org/wikipedia/commons/b/bb/MoroccoMarrakech_townfromhill2.jpg" text={text}/>
        </div>
    </>
  )
}

export default App
